from hangul_utils.unicode import *

# 단순모음
CHAR_SIMPLE_MEDIALS = [
    'ㅏ', 'ㅐ' , 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅛ', 'ㅜ', 'ㅠ', 'ㅡ', 'ㅣ'
]

# 모든 자음 모음
CHAR_CONSONANTS = [
    'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ',
    'ㅂ', 'ㅃ', 'ㅄ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
]

# 이중자음
DOUBLE_CONSONANTS = [
    ['ㄱ', 'ㅅ'],  #ㄳ
    ['ㄴ', 'ㅈ'],  #ㄵ
    ['ㄴ', 'ㅎ'], #ㄶ
    ['ㄹ', 'ㄱ'],  #ㄺ
    ['ㄹ', 'ㅁ'], #ㄻ
    ['ㄹ', 'ㅂ'], #ㄼ
    ['ㄹ', 'ㅅ'], #ㄽ
    ['ㄹ', 'ㅌ'],  #ㄾ
    ['ㄹ', 'ㅍ'], #ㄿ
    ['ㄹ', 'ㅎ'], #ㅀ
    ['ㅂ', 'ㅅ'] #ㅄ
]

# 이중모음
DOUBLE_VOWELS = [
    ['ㅗ','ㅏ'], # ㅘ
    ['ㅗ','ㅐ'], # ㅙ
    ['ㅗ','ㅣ'], #ㅚ
    ['ㅜ','ㅓ'], #ㅝ
    ['ㅜ','ㅔ'], #ㅞ
    ['ㅜ','ㅣ'], #ㅟ
    ['ㅡ','ㅣ'] #ㅢ
]

# 치음
TOOTH_CONSONANTS = ["ㄷ", "ㄸ", "ㅅ", "ㅆ", "ㅈ", "ㅉ", "ㅊ"]

# 유사한 초성. 거지/ 꺼찌를 유사 초성으로 처리.
SIMILAR_INITIALS = {
        "ㄱ": ["ㄲ", "ㅋ"],
        "ㄲ": ['ㅋ'],
        "ㄷ": ["ㄸ", "ㅌ", "ㅆ", "ㅉ"],
        "ㄸ": ["ㅌ", "ㅉ"],
        "ㄹ": ["ㄴ"],
        "ㅂ": ["ㅃ", "ㅍ"],
        "ㅃ": ["ㅍ"],
        "ㅅ": ["ㄸ", "ㅆ", "ㅉ"],
        "ㅆ": ["ㅉ"],
        "ㅈ": ["ㅆ", "ㅉ", "ㅊ"],
        "ㅉ": ["ㅊ", "ㅆ"],
        "ㅊ": ["ㅉ"],
        "ㅋ": ["ㄲ"],
        "ㅌ": ["ㄸ"],
        "ㅍ": ["ㅃ"],
        "ㅎ": ["ㅍ"]
    }

# 유사모음. 바보/뱌뵤를 유사한 모음으로 처리.
SIMILAR_MIDDLES = {
        "ㅏ": [["ㅑ"], ["ㅗ", "ㅏ"]],
        "ㅐ": [["ㅒ"], ["ㅔ"], ["ㅖ"], ["ㅗ", "ㅐ"], ["ㅗ", "ㅣ"], ["ㅜ","ㅔ"]],
        "ㅒ": [["ㅖ"]],
        "ㅓ": [["ㅕ"], ["ㅜ", "ㅓ"], ["ㅗ"]],
        "ㅔ": [["ㅒ"], ["ㅔ"], ["ㅖ"], ["ㅗ", "ㅐ"], ["ㅗ", "ㅣ"], ["ㅜ","ㅔ"]],
        "ㅕ": [["ㅛ"]],
        "ㅖ": [["ㅖ"]],
        "ㅗ": [["ㅓ"], ["ㅛ"]],
        "ㅙ": [["ㅗ", "ㅣ"], ["ㅜ","ㅔ"]],
        "ㅚ": [["ㅗ", "ㅐ"], ["ㅜ","ㅔ"]],
        "ㅛ": [["ㅕ"]],
        "ㅜ": [["ㅠ"],["ㅡ"]],
        "ㅞ": [["ㅗ", "ㅐ"], ["ㅗ", "ㅣ"]],
        "ㅡ": [["ㅜ"]],
        "ㅣ": [["ㅜ","ㅣ"], ["ㅡ", "ㅣ"]]
    }

# 치음일 때 유사중성. 쟈/자는 구별되지 않는다.
TOOTH_SIMILAR_MIDDLES = {
    **SIMILAR_MIDDLES,
    "ㅑ":[["ㅏ"], ["ㅗ", "ㅏ"]],
    "ㅒ": [["ㅐ"], ["ㅔ"], ["ㅖ"], ["ㅗ", "ㅐ"], ["ㅗ", "ㅣ"], ["ㅜ","ㅔ"]],
    "ㅕ":[["ㅓ"], ["ㅜ","ㅓ"], ["ㅗ"], ["ㅛ"]],
    "ㅖ":[["ㅐ"], ["ㅔ"], ["ㅒ"], ["ㅗ", "ㅐ"], ["ㅗ", "ㅣ"], ["ㅜ","ㅔ"]],
    "ㅛ":[["ㅓ"], ["ㅕ"], ["ㅜ","ㅓ"], ["ㅗ"]],
    "ㅠ":[["ㅜ"], ["ㅡ"]]
}

#유사한 종성. 뻑/뻨은 구별불가능.
SIMILAR_ENDS = {
    "ㄱ": ["ㅋ", "ㄲ"],
    "ㄲ":["ㄱ", "ㅋ"],
    "ㄷ":["ㅌ", "ㅅ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅂ":["ㅂ", "ㅍ"],
    "ㅅ":["ㄷ", "ㅌ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅆ":["ㄷ", "ㅌ", "ㅅ", "ㅈ", "ㅊ"],
    "ㅈ":["ㄷ", "ㅌ", "ㅅ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅊ":["ㄷ", "ㅌ", "ㅅ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅋ":["ㄱ", "ㄲ"],
    "ㅌ":["ㄷ", "ㅅ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅍ":["ㅂ", "ㅍ"],
    "ㅎ":["ㅅ"]
}

# 뒷글자에 의한 자음동화 여부 검사.
# 뒷글자 앞자음: [유사하게 처리할 받침 목록들]. 예를 들어 심부/십부를 비슷한 유형으로 인식.
JOINT_CONSONANTS = {
    "ㄱ": ["ㄱ", "ㄲ", "ㅋ"],
    "ㄲ": ["ㄱ", "ㅋ", "ㄲ"],
    "ㄴ": ["ㄴ", "ㄷ", "ㅅ"],
    "ㄷ": ["ㄷ", "ㅌ", "ㅅ", "ㅆ", "ㅈ", "ㅊ"],
    "ㄸ": ["ㄷ","ㅌ", "ㄸ", "ㅅ", "ㅆ", "ㅈ", "ㅊ" ],
    "ㄹ": ["ㄴ", "ㄹ"],
    "ㅁ": ["ㅁ", "ㅂ", "ㅍ"],
    "ㅂ": ["ㅁ", "ㅂ", "ㅍ"],
    "ㅃ": ["ㅁ", "ㅂ", "ㅃ"],
    "ㅅ": ["ㅅ", "ㄷ", "ㅌ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅆ": ["ㄷ", "ㅌ", "ㅅ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅈ": ["ㄷ", "ㅌ", "ㅅ", "ㅈ", "ㅆ", "ㅊ"],
    "ㅊ": ["ㄷ", "ㅌ", "ㅅ", "ㅆ", "ㅈ", "ㅊ"],
    "ㅋ": ["ㄱ", "ㄲ", "ㅋ"],
    "ㅌ": ["ㄷ", "ㅅ", "ㅆ", "ㅈ", "ㅊ", "ㅌ"],
    "ㅍ": ["ㅁ", "ㅂ", "ㅍ"],
    "ㅎ": ["ㅎ"]
}

# ㅣ 앞에 왔을 때 모음동화용. 자비/재비를 유사글자로
JOINT_VOWELS = {
    "ㅏ": [["ㅐ"]],
    "ㅑ": [["ㅒ"], ["ㅖ"]],
    "ㅓ": [["ㅔ"]],
    "ㅕ": [["ㅒ"], ["ㅖ"]],
    "ㅗ": [["ㅗ", "ㅣ"]],
    "ㅜ": [["ㅜ", "ㅣ"]],
    "ㅡ": [["ㅡ", "ㅣ"]]
}

# 두벌식- QWERTY 키보드 맵.

QWERTY_DUBEOL_MAPPING= {
    'q': 'ㅂ', 'Q': 'ㅃ', 'w': 'ㅈ', 'W': 'ㅉ', 'e': 'ㄷ', 'E': 'ㄸ', 'r': 'ㄱ', 'R': 'ㄲ', 't': 'ㅅ', 'T': 'ㅆ',
    'y': 'ㅛ', 'Y': 'ㅛ', 'u': 'ㅕ', 'U': 'ㅕ', 'i': 'ㅑ', 'I': 'ㅑ', 'o': 'ㅐ', 'O': 'ㅒ', 'p': 'ㅔ', 'P': 'ㅖ',
    'a': 'ㅁ', 'A': 'ㅁ', 's': 'ㄴ', 'S': 'ㄴ', 'd': 'ㅇ', 'D': 'ㅇ', 'f': 'ㄹ', 'F': 'ㄹ', 'g': 'ㅎ', 'G': 'ㅎ',
    'h': 'ㅗ', 'H': 'ㅗ', 'j': 'ㅓ', 'J': 'ㅓ', 'k': 'ㅏ', 'K': 'ㅏ', 'l': 'ㅣ', 'L': 'ㅣ',
    'z': 'ㅋ', 'Z': 'ㅋ', 'x': 'ㅌ', 'X': 'ㅌ', 'c': 'ㅊ', 'C': 'ㅊ', 'v': 'ㅍ', 'V': 'ㅍ',
    'b': 'ㅠ', 'B': 'ㅠ', 'n': 'ㅜ', 'N': 'ㅜ', 'm': 'ㅡ', 'M': 'ㅡ', '2': 'ㅣ', '5': 'ㅗ', '^': 'ㅅ', '@': "ㅇ"
}

# 자모와 자형이 유사할 경우
PSEUDO_CONSONANTS = {
    '2':'ㄹ', '3':'ㅌ', "5":'ㄹ', '7':'ㄱ', '0':'ㅇ',
    'C':'ㄷ', 'c':'ㄷ', 'D':'ㅁ', 'E':'ㅌ', "L":'ㄴ',
    'M':'ㅆ', 'm':'ㅆ', 'n':'ㅅ', 'S':'ㄹ', 's':'ㄹ',
    'V':'ㅅ', 'v':'ㅅ', 'w':'ㅆ', 'W':'ㅆ', 'Z':'ㄹ',
    'z':'ㄹ', '@':'ㅇ', '#':'ㅂ', '^':'ㅅ',
}

# 모음과 자형이 유사한 경우
PSEUDO_VOWELS = {
    '1':'ㅣ', 'H':'ㅐ', 'I':'ㅣ', 'l':'ㅣ',
    'T':'ㅜ', 't':'ㅜ', 'y':'ㅓ', '!':'ㅣ',
    '_':'ㅡ', '-':'ㅡ', '|':'ㅣ'
}


# 겹자읍/겹모음 분리 딕셔너리. 우선 쌍자음은 분리하지 않기.
DICT_DOUBLE_JAMOS = {
    # "ㄲ": "ㄱㄱ",
    "ㄳ": "ㄱㅅ",
    "ㄵ": "ㄴㅈ",
    "ㄶ": "ㄴㅎ",
    # "ㄸ": "ㄷㄷ",
    "ㄺ": "ㄹㄱ",
    "ㄻ": "ㄹㅁ",
    "ㄼ": "ㄹㅂ",
    "ㄽ": "ㄹㅅ",
    "ㄾ": "ㄹㅌ",
    "ㄿ": "ㄹㅍ",
    "ㅀ": "ㄹㅎ",
    # "ㅃ": "ㅂㅂ",
    "ㅄ": "ㅂㅅ",
    # "ㅆ": "ㅅㅅ",
    # "ㅉ": "ㅈㅈ",
    "ㅘ": "ㅗㅏ",
    "ㅙ": "ㅗㅐ",
    "ㅚ": "ㅗㅣ",
    "ㅝ": "ㅜㅓ",
    "ㅞ": "ㅜㅔ",
    "ㅟ": "ㅜㅣ",
    "ㅢ": "ㅡㅣ"
}

DICT_JOIN_DOUBLE_JAMOS = {
    "ㄱㅅ": "ㄳ",
    "ㄴㅈ": "ㄵ",
    "ㄴㅎ": "ㄶ",
    "ㄹㄱ": "ㄺ",
    "ㄹㅁ": "ㄻ",
    "ㄹㅂ": "ㄼ",
    "ㄹㅅ": "ㄽ",
    "ㄹㅌ": "ㄾ",
    "ㄹㅍ": "ㄿ",
    "ㄹㅎ": "ㅀ",
    "ㅂㅂ": "ㅃ",
    "ㅂㅅ": "ㅄ",
    "ㅈㅈ": "ㅉ",
    "ㅗㅏ": "ㅘ",
    "ㅗㅐ": "ㅙ",
    "ㅗㅣ": "ㅚ",
    "ㅜㅓ": "ㅝ",
    "ㅜㅔ": "ㅞ",
    "ㅜㅣ": "ㅟ",
    "ㅡㅣ": "ㅢ"
}